SpenceKonde/DxCore/megaavr/boards.txt
##########################################################################
#                                                                        #
#  #######              #####                                            #
#  ##                  ##```                                             #
#  ##     ## ##   ##   ##      ###  ####  ####     ##     ###     #####  #
#  ##     ##  ## ##    ##     #   # #   # #       ###        #       #   #
#  ##     ##   ###     ##     #   # ####  ###      ##      ##       #    #
#  ##    ##   ## ##    ##___  #   # # #   #        ##  ##    # ##   #    #
#  #######   ##   ##    #####  ###  #  #  ####    #### ## ###  ##   #    #
#________________________________________________________________________#
#                                                                        #
#  Copyright Spence Konde and other contributors 2020-2021               #
#  Based on megaTinyCore which in turn is based on official Arduino core #
#  Varying portions of different files in this core can be traced back   #
#  to the official core. In any event, it's all free software, under the #
#  (LGPL v2.1) see LICENSE.md and License section of README.md           #
#________________________________________________________________________#
#                                                                        #
#  Now reformatted for easy navigation with text editing tools which     #
#  have the zoomed out view that you can scroll through.                 #
#  The board section headings have a triangle along the right edge       #
#  if they are a non-bootloader definition.                              #
#________________________________________________________________________#
#                                                                        #
#                ####    ###    ###   ####   ####    ###                 #
#                #   #  #   #  #   #  #   #  #   #  #                    #
#                ####   #   #  #####  ####   #   #   ###                 #
#                #   #  #   #  #   #  #  #   #   #      #                #
#                ####    ###   #   #  #   #  ####    ###                 #
#________________________________________________________________________#
#                                                                        #
# Names listed at the top so they can be kept in consistent format.      #
# Experience has shown that they end up drifting apart is style if       #
# they aren't; all on the same screen                                    #
#                                                                        #
# EA, DD are not available yet                                           #
#                                                                        #
# All DD board defs sketched in and commented out, very few unknowns     #
#                                                                        #
# Only EA boards without optiboot sketched in - since we know like       #
# nothing about implementation, and how Dx-y it will be and how tinyy    #
# it will be                                                             #
#________________________________________________________________________#

avrda.name=AVR DA-series (no bootloader)
avrdb.name=AVR DB-series (no bootloader)
#avrdd.name=AVR DD-series (no bootloader)
#avrea.name=AVR EA-series (no bootloader)
#azduinonano.name=Azduino "nano-shaped" boards
avrdaopti.name=AVR DA-series (Optiboot)
avrdbopti.name=AVR DB-series (Optiboot)
#avrddopti.name=AVR DD-series (Optiboot)
#avreaopti.name=AVR EA-series (Optiboot)



##########################################################################
#                                                                        #
#          ###  #   #  ####   #   #  ####  #   #  #   #   ###            #
#         #     #   #  #   #  ## ##  #     ##  #  #   #  #               #
#          ###  #   #  ####   # # #  ###   # # #  #   #   ###            #
#             # #   #  #   #  #   #  #     #  ##  #   #      #           #
#          ###   ###   ####   #   #  ####  #   #   ###    ###            #
#________________________________________________________________________#

menu.chip=Chip
menu.clock=Clock Speed
menu.millis=millis()/micros() timer
menu.bodvoltage=BOD level if enabled (Bootload burn req'd)
menu.bodmode=BOD Mode Active/Sleeping (Bootload burn req'd)
menu.eesave=Save EEPROM (Bootload burn req'd)
menu.resetpin=Reset pin function (Bootload burn req'd)
menu.resetupdipins=Reset and UPDI are: (Bootload burn req'd)
menu.startuptime=Startup Time (Bootload burn req'd)
menu.bootloaderusart=Bootloader Serial Port (Bootload burn req'd)
menu.timeout=Bootloader Timeout (Bootload burn req'd)
menu.appspm=Flash Writing
menu.mvio=MultiVoltage I/O (MVIO)
menu.attach=attachInterrupt() Version
menu.printf=printf()



##########################################################################
#                                                                        #
###                 ###  #     # ####      ####   ###                  ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # #####             #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####  #   #                 ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for DA parts   #
#________________________________________#
avrda.upload.tool=avrdude
avrda.build.board=avrda
avrda.build.core=dxcore
avrda.build.text_section_start=.text=0x0
avrda.build.extra_flags={bootloader.appspm}
avrda.build.export_merged_output=false
avrda.build.printf=
#------------------------------------#
# Bootloading parameters and fuses   #
#____________________________________#
avrda.bootloader.tool=avrdude
avrda.bootloader.WDTCFG=0x00
avrda.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrda.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda.bootloader.CODESIZE=0x00
avrda.bootloader.BOOTSIZE=0x01
avrda.bootloader.avrdudestring=
avrda.bootloader.pymcuprogstring=-aerase
#------------------------------------#
# Exported hex/lst/map names will    #
# indicate selected options. These   #
# are only to do that, nothing else  #
#____________________________________#
avrda.build.mcupostfix=
avrda.build.printfabr=
avrda.build.appspmabr=.spm{bootloader.CODESIZE}

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DA submenu options                 #
#________________________________________#
# Chip (memory and pincount)         #
#____________________________________#
avrda.menu.chip.128DA28=AVR128DA28
avrda.menu.chip.128DA28.build.mcu=avr128da28
avrda.menu.chip.128DA28.upload.maximum_size=131072
avrda.menu.chip.128DA28.upload.maximum_data_size=16384
avrda.menu.chip.128DA28.build.variant=28pin-standard
avrda.menu.chip.128DA32=AVR128DA32
avrda.menu.chip.128DA32.build.mcu=avr128da32
avrda.menu.chip.128DA32.upload.maximum_size=131072
avrda.menu.chip.128DA32.upload.maximum_data_size=16384
avrda.menu.chip.128DA32.build.variant=32pin-standard
avrda.menu.chip.128DA48=AVR128DA48
avrda.menu.chip.128DA48.build.mcu=avr128da48
avrda.menu.chip.128DA48.upload.maximum_size=131072
avrda.menu.chip.128DA48.upload.maximum_data_size=16384
avrda.menu.chip.128DA48.build.variant=48pin-standard
avrda.menu.chip.128DA64=AVR128DA64
avrda.menu.chip.128DA64.build.mcu=avr128da64
avrda.menu.chip.128DA64.upload.maximum_size=131072
avrda.menu.chip.128DA64.upload.maximum_data_size=16384
avrda.menu.chip.128DA64.build.variant=64pin-standard
avrda.menu.chip.64DA28=AVR64DA28
avrda.menu.chip.64DA28.build.mcu=avr64da28
avrda.menu.chip.64DA28.upload.maximum_size=65536
avrda.menu.chip.64DA28.upload.maximum_data_size=8192
avrda.menu.chip.64DA28.build.variant=28pin-standard
avrda.menu.chip.64DA32=AVR64DA32
avrda.menu.chip.64DA32.build.mcu=avr64da32
avrda.menu.chip.64DA32.upload.maximum_size=65536
avrda.menu.chip.64DA32.upload.maximum_data_size=8192
avrda.menu.chip.64DA32.build.variant=32pin-standard
avrda.menu.chip.64DA48=AVR64DA48
avrda.menu.chip.64DA48.build.mcu=avr64da48
avrda.menu.chip.64DA48.upload.maximum_size=65536
avrda.menu.chip.64DA48.upload.maximum_data_size=8192
avrda.menu.chip.64DA48.build.variant=48pin-standard
avrda.menu.chip.64DA64=AVR64DA64
avrda.menu.chip.64DA64.build.mcu=avr64da64
avrda.menu.chip.64DA64.upload.maximum_size=65536
avrda.menu.chip.64DA64.upload.maximum_data_size=8192
avrda.menu.chip.64DA64.build.variant=64pin-standard
avrda.menu.chip.32DA28=AVR32DA28
avrda.menu.chip.32DA28.build.mcu=avr32da28
avrda.menu.chip.32DA28.upload.maximum_size=32768
avrda.menu.chip.32DA28.upload.maximum_data_size=4096
avrda.menu.chip.32DA28.build.variant=28pin-standard
avrda.menu.chip.32DA32=AVR32DA32
avrda.menu.chip.32DA32.build.mcu=avr32da32
avrda.menu.chip.32DA32.upload.maximum_size=32768
avrda.menu.chip.32DA32.upload.maximum_data_size=4096
avrda.menu.chip.32DA32.build.variant=32pin-standard
avrda.menu.chip.32DA48=AVR32DA48
avrda.menu.chip.32DA48.build.mcu=avr32da48
avrda.menu.chip.32DA48.upload.maximum_size=32768
avrda.menu.chip.32DA48.upload.maximum_data_size=4096
avrda.menu.chip.32DA48.build.variant=48pin-standard

#------------------------------------#
# Clock speed and source options     #
#____________________________________#
avrda.menu.clock.24internal=24 MHz internal
avrda.menu.clock.24internal.build.f_cpu=24000000L
avrda.menu.clock.24internal.build.speed=24
avrda.menu.clock.24internal.build.clocksource=0
avrda.menu.clock.20internal=20 MHz internal
avrda.menu.clock.20internal.build.f_cpu=20000000L
avrda.menu.clock.20internal.build.speed=20
avrda.menu.clock.20internal.build.clocksource=0
avrda.menu.clock.16internal=16 MHz internal
avrda.menu.clock.16internal.build.f_cpu=16000000L
avrda.menu.clock.16internal.build.speed=16
avrda.menu.clock.16internal.build.clocksource=0
avrda.menu.clock.12internal=12 MHz internal
avrda.menu.clock.12internal.build.f_cpu=12000000L
avrda.menu.clock.12internal.build.speed=12
avrda.menu.clock.12internal.build.clocksource=0
avrda.menu.clock.10internal=10 MHz internal
avrda.menu.clock.10internal.build.f_cpu=10000000L
avrda.menu.clock.10internal.build.speed=10
avrda.menu.clock.10internal.build.clocksource=0
avrda.menu.clock.8internal=8 MHz internal
avrda.menu.clock.8internal.build.f_cpu=8000000L
avrda.menu.clock.8internal.build.speed=8
avrda.menu.clock.8internal.build.clocksource=0
avrda.menu.clock.4internal=4 MHz internal
avrda.menu.clock.4internal.build.f_cpu=4000000L
avrda.menu.clock.4internal.build.speed=4
avrda.menu.clock.4internal.build.clocksource=0
avrda.menu.clock.1internal=1 MHz internal
avrda.menu.clock.1internal.build.f_cpu=1000000L
avrda.menu.clock.1internal.build.speed=1
avrda.menu.clock.1internal.build.clocksource=0
avrda.menu.clock.24extclock=24 MHz ext. clock
avrda.menu.clock.24extclock.build.f_cpu=24000000L
avrda.menu.clock.24extclock.build.speed=24
avrda.menu.clock.24extclock.build.clocksource=2
avrda.menu.clock.20extclock=20 MHz ext. clock
avrda.menu.clock.20extclock.build.f_cpu=20000000L
avrda.menu.clock.20extclock.build.speed=20
avrda.menu.clock.20extclock.build.clocksource=2
avrda.menu.clock.16extclock=16 MHz ext. clock
avrda.menu.clock.16extclock.build.f_cpu=16000000L
avrda.menu.clock.16extclock.build.speed=16
avrda.menu.clock.16extclock.build.clocksource=2
avrda.menu.clock.12extclock=12 MHz ext. clock
avrda.menu.clock.12extclock.build.f_cpu=12000000L
avrda.menu.clock.12extclock.build.speed=12
avrda.menu.clock.12extclock.build.clocksource=2
avrda.menu.clock.8extclock=8 MHz ext. clock
avrda.menu.clock.8extclock.build.f_cpu=8000000L
avrda.menu.clock.8extclock.build.speed=8
avrda.menu.clock.8extclock.build.clocksource=2
avrda.menu.clock.28internal=28 MHz internal (overclocked)
avrda.menu.clock.28internal.build.f_cpu=28000000L
avrda.menu.clock.28internal.build.speed=28
avrda.menu.clock.28internal.build.clocksource=0
avrda.menu.clock.32internal=32 MHz internal (overclocked)
avrda.menu.clock.32internal.build.f_cpu=32000000L
avrda.menu.clock.32internal.build.speed=32
avrda.menu.clock.32internal.build.clocksource=0
avrda.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
avrda.menu.clock.25extclock.build.f_cpu=25000000L
avrda.menu.clock.25extclock.build.speed=25
avrda.menu.clock.25extclock.build.clocksource=2
avrda.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrda.menu.clock.28extclock.build.f_cpu=28000000L
avrda.menu.clock.28extclock.build.speed=28
avrda.menu.clock.28extclock.build.clocksource=2
avrda.menu.clock.30extclock=30 MHz ext. clock (overclocked)
avrda.menu.clock.30extclock.build.f_cpu=30000000L
avrda.menu.clock.30extclock.build.speed=30
avrda.menu.clock.30extclock.build.clocksource=2
avrda.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrda.menu.clock.32extclock.build.f_cpu=32000000L
avrda.menu.clock.32extclock.build.speed=32
avrda.menu.clock.32extclock.build.clocksource=2
avrda.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrda.menu.clock.36extclock.build.f_cpu=36000000L
avrda.menu.clock.36extclock.build.speed=36
avrda.menu.clock.36extclock.build.clocksource=2
avrda.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrda.menu.clock.40extclock.build.f_cpu=40000000L
avrda.menu.clock.40extclock.build.speed=40
avrda.menu.clock.40extclock.build.clocksource=2
avrda.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrda.menu.clock.48extclock.build.f_cpu=48000000L
avrda.menu.clock.48extclock.build.speed=48
avrda.menu.clock.48extclock.build.clocksource=2

#------------------------------------#
# BrownOut detection (BOD) options   #
#____________________________________#
avrda.menu.bodvoltage.1v9=1.9V
avrda.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrda.menu.bodvoltage.2v45=2.45V
avrda.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrda.menu.bodvoltage.2v70=2.70V
avrda.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrda.menu.bodvoltage.2v85=2.85V
avrda.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrda.menu.bodmode.disabled=Disabled/Disabled
avrda.menu.bodmode.enabled=Enabled/Enabled
avrda.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrda.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrda.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrda.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrda.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrda.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrda.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrda.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrda.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrda.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrda.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrda.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrda.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrda.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrda.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrda.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#------------------------------------#
# Retain EEPROM (EESAVE)             #
#____________________________________#
avrda.menu.eesave.enable=EEPROM retained
avrda.menu.eesave.enable.bootloader.eesavebit=1
avrda.menu.eesave.disable=EEPROM not retained
avrda.menu.eesave.disable.bootloader.eesavebit=0

#------------------------------------#
# Reset pin as input option          #
#____________________________________#
avrda.menu.resetpin.reset=Hardware Reset (recommended)
avrda.menu.resetpin.reset.bootloader.resetpinbits=10
avrda.menu.resetpin.input=Input (no output, ever)
avrda.menu.resetpin.input.bootloader.resetpinbits=00

#------------------------------------#
# millis/micros timing source        #
#____________________________________#
avrda.menu.millis.tcb2=TCB2 (recommended)
avrda.menu.millis.disabled=Disabled
avrda.menu.millis.tcb0=TCB0
avrda.menu.millis.tcb1=TCB1
avrda.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrda.menu.millis.tcb4=TCB4 (64-pin parts only)
avrda.menu.millis.tca0=TCA0
avrda.menu.millis.tca1=TCA1 (48/64-pin parts only)
#avrda.menu.millis.tcd0=TCD0
#avrda.menu.millis.rtc=RTC (no micros)
#avrda.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal, no micros
#avrda.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avrda.menu.millis.tcb0.build.millistimer=B0
avrda.menu.millis.tcb1.build.millistimer=B1
avrda.menu.millis.tcb2.build.millistimer=B2
avrda.menu.millis.tcb3.build.millistimer=B3
avrda.menu.millis.tcb4.build.millistimer=B4
avrda.menu.millis.tca0.build.millistimer=A0
avrda.menu.millis.tca1.build.millistimer=A1
#avrda.menu.millis.tcd0.build.millistimer=D0
#avrda.menu.millis.rtc.build.millistimer=RTC
#avrda.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
#avrda.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrda.menu.millis.disabled.build.millistimer=NONE

#------------------------------------#
# printf() version options           #
#____________________________________#
avrda.menu.printf.default=Default, 1.5k flash, no floats
avrda.menu.printf.full=Full, 2.6k, prints floats
avrda.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrda.menu.printf.full.build.printfabr=.pfF
avrda.menu.printf.minimal=Minimal, 1.1k flash used
avrda.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrda.menu.printf.minimal.build.printfabr=.pfM

#------------------------------------#
# attachInterrupt Mode               #
#____________________________________#
avrda.menu.attach.allenabled=On all pins, like usual
avrda.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrda.menu.attach.manual=Only enabled ports. Please see documentation
avrda.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrda.menu.attach.oldversion=Old version, (may fix bugs)
avrda.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD

