SpenceKonde/DxCore/megaavr/boards.txt
#------------------------------------#
# Reset pin as INPUT, UPDI as I/O    #
#____________________________________#
#  Values speculative           #
#  Features Known               #
#_______________________________#
#avrea.menu.resetupdipins.resetupdi=Reset & UPDI
#avrea.menu.resetupdipins.resetupdi.bootloader.resetpinbits=11
#avrea.menu.resetupdipins.inputupdi=Input & UPDI (no challenges)
#avrea.menu.resetupdipins.inputupdi.bootloader.resetpinbits=10
#avrea.menu.resetupdipins.resetgpio=Reset & GPIO (HV pulse RST for UPDI)
#avrea.menu.resetupdipins.resetgpio.bootloader.resetpinbits=01
#avrea.menu.resetupdipins.inputgpio=Input & GPIO (HV pulse RST for UPDI)
#avrea.menu.resetupdipins.inputgpio.bootloader.resetpinbits=00

#------------------------------------#
# millis/micros timing source        #
#____________________________________#
#avrea.menu.millis.tcb2=TCB2 (recommended)
#avrea.menu.millis.disabled=Disabled
#avrea.menu.millis.tcb0=TCB0
#avrea.menu.millis.tcb1=TCB1
#avrea.menu.millis.tcb3=TCB3
#avrea.menu.millis.tca0=TCA0
#avrea.menu.millis.tca1=TCA1
##avrea.menu.millis.rtc=RTC (no micros)
##avrea.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal, no micros
##avrea.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
#avrea.menu.millis.tcb0.build.millistimer=B0
#avrea.menu.millis.tcb1.build.millistimer=B1
#avrea.menu.millis.tcb2.build.millistimer=B2
#avrea.menu.millis.tcb3.build.millistimer=B3
#avrea.menu.millis.tca0.build.millistimer=A0
#avrea.menu.millis.tca1.build.millistimer=A1
##avrea.menu.millis.rtc.build.millistimer=RTC
##avrea.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
##avrea.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
#avrea.menu.millis.disabled.build.millistimer=NONE

#------------------------------------#
# printf() version options           #
#____________________________________#
#avrea.menu.printf.default=Default, 1.5k flash, no floats
#avrea.menu.printf.full=Full, 2.6k, prints floats
#avrea.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
#avrea.menu.printf.full.build.printfabr=.pfF
#avrea.menu.printf.minimal=Minimal, 1.1k flash used
#avrea.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
#avrea.menu.printf.minimal.build.printfabr=.pfM

#------------------------------------#
# Startup time options               #
#____________________________________#
#                               #
#  Speculative but likely       #
#_______________________________#
#avrea.menu.startuptime.8=8ms
#avrea.menu.startuptime.1=0ms
#avrea.menu.startuptime.1=1ms
#avrea.menu.startuptime.2=2ms
#avrea.menu.startuptime.4=4ms
#avrea.menu.startuptime.16=16ms
#avrea.menu.startuptime.32=32ms
#avrea.menu.startuptime.64=64ms
#avrea.menu.startuptime.0.bootloader.SYSCFG1=0x00
#avrea.menu.startuptime.1.bootloader.SYSCFG1=0x01
#avrea.menu.startuptime.2.bootloader.SYSCFG1=0x02
#avrea.menu.startuptime.4.bootloader.SYSCFG1=0x03
#avrea.menu.startuptime.8.bootloader.SYSCFG1=0x04
#avrea.menu.startuptime.16.bootloader.SYSCFG1=0x05
#avrea.menu.startuptime.32.bootloader.SYSCFG1=0x06
#avrea.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
# SPM from app incompatible with Dx   #
# version of flash write in major way #
#_____________________________________#

##########################################################################
#                                                                        #
#   ###  #     # ####      ####   ###            ###          #          #
#  #   # #     # #   #     #   # #   #          #   #        ###  ##     #
#  #####  #   #  ####  ### #   # #####          #   #  ###    #          #
#  #   #   # #   # #       #   # #   #          #   #  #  #   #   ##     #
#  #   #    #    #  #      ####  #   #           ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# Parameters and defaults for DA parts   #
#________________________________________#
avrdaopti.build.board=avrda
avrdaopti.build.core=dxcore
avrdaopti.build.text_section_start=.text=0x200
avrdaopti.build.extra_flags=-DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT
avrdaopti.build.export_merged_output=false
avrdaopti.build.printf=
#------------------------------------#
# Bootloading parameters and fuses   #
#____________________________________#
avrdaopti.bootloader.tool=avrdude
avrdaopti.bootloader.WDTCFG=0x00
avrdaopti.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrdaopti.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
avrdaopti.bootloader.CODESIZE=0x00
avrdaopti.bootloader.BOOTSIZE=0x01
avrdaopti.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex:i
avrdaopti.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file}{bootloader.port}{bootloader.timeout}.hex -a write
#------------------------------------#
# Upload parameters for Optiboot     #
#____________________________________#
avrdaopti.upload.tool=avrdude
avrdaopti.upload.protocol=arduino
avrdaopti.upload.extra_params=-D
avrdaopti.upload.speed=115200
#------------------------------------#
# Exported hex/lst/map names will    #
# indicate selected options. These   #
# are only to do that, nothing else  #
#____________________________________#
avrdaopti.build.mcupostfix=opti
avrdaopti.build.printfabr=
avrdaopti.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DA (Optiboot) submenu options      #
#________________________________________#
#                                    #
# Chip (memory and pincount)         #
#____________________________________#
avrdaopti.menu.chip.128DA28=AVR128DA28
avrdaopti.menu.chip.128DA28.build.mcu=avr128da28
avrdaopti.menu.chip.128DA28.upload.maximum_size=130560
avrdaopti.menu.chip.128DA28.bootloader.file=optiboot_dx128
avrdaopti.menu.chip.128DA28.upload.maximum_data_size=16384
avrdaopti.menu.chip.128DA28.build.variant=28pin-standard
avrdaopti.menu.chip.128DA32=AVR128DA32
avrdaopti.menu.chip.128DA32.build.mcu=avr128da32
avrdaopti.menu.chip.128DA32.upload.maximum_size=130560
avrdaopti.menu.chip.128DA32.bootloader.file=optiboot_dx128
avrdaopti.menu.chip.128DA32.upload.maximum_data_size=16384
avrdaopti.menu.chip.128DA32.build.variant=32pin-standard
avrdaopti.menu.chip.128DA48=AVR128DA48
avrdaopti.menu.chip.128DA48.build.mcu=avr128da48
avrdaopti.menu.chip.128DA48.upload.maximum_size=130560
avrdaopti.menu.chip.128DA48.bootloader.file=optiboot_dx128
avrdaopti.menu.chip.128DA48.upload.maximum_data_size=16384
avrdaopti.menu.chip.128DA48.build.variant=48pin-standard
avrdaopti.menu.chip.128DA64=AVR128DA64
avrdaopti.menu.chip.128DA64.build.mcu=avr128da64
avrdaopti.menu.chip.128DA64.upload.maximum_size=130560
avrdaopti.menu.chip.128DA64.bootloader.file=optiboot_dx128
avrdaopti.menu.chip.128DA64.upload.maximum_data_size=16384
avrdaopti.menu.chip.128DA64.build.variant=64pin-standard
avrdaopti.menu.chip.64DA28=AVR64DA28
avrdaopti.menu.chip.64DA28.build.mcu=avr64da28
avrdaopti.menu.chip.64DA28.upload.maximum_size=65024
avrdaopti.menu.chip.64DA28.bootloader.file=optiboot_dx64
avrdaopti.menu.chip.64DA28.upload.maximum_data_size=8192
avrdaopti.menu.chip.64DA28.build.variant=28pin-standard
avrdaopti.menu.chip.64DA32=AVR64DA32
avrdaopti.menu.chip.64DA32.build.mcu=avr64da32
avrdaopti.menu.chip.64DA32.upload.maximum_size=65024
avrdaopti.menu.chip.64DA32.bootloader.file=optiboot_dx64
avrdaopti.menu.chip.64DA32.upload.maximum_data_size=8192
avrdaopti.menu.chip.64DA32.build.variant=32pin-standard
avrdaopti.menu.chip.64DA48=AVR64DA48
avrdaopti.menu.chip.64DA48.build.mcu=avr64da48
avrdaopti.menu.chip.64DA48.upload.maximum_size=65024
avrdaopti.menu.chip.64DA48.bootloader.file=optiboot_dx64
avrdaopti.menu.chip.64DA48.upload.maximum_data_size=8192
avrdaopti.menu.chip.64DA48.build.variant=48pin-standard
avrdaopti.menu.chip.64DA64=AVR64DA64
avrdaopti.menu.chip.64DA64.build.mcu=avr64da64
avrdaopti.menu.chip.64DA64.upload.maximum_size=65024
avrdaopti.menu.chip.64DA64.bootloader.file=optiboot_dx64
avrdaopti.menu.chip.64DA64.upload.maximum_data_size=8192
avrdaopti.menu.chip.64DA64.build.variant=64pin-standard
avrdaopti.menu.chip.32DA28=AVR32DA28
avrdaopti.menu.chip.32DA28.build.mcu=avr32da28
avrdaopti.menu.chip.32DA28.upload.maximum_size=32256
avrdaopti.menu.chip.32DA28.bootloader.file=optiboot_dx32
avrdaopti.menu.chip.32DA28.upload.maximum_data_size=4096
avrdaopti.menu.chip.32DA28.build.variant=28pin-standard
avrdaopti.menu.chip.32DA32=AVR32DA32
avrdaopti.menu.chip.32DA32.build.mcu=avr32da32
avrdaopti.menu.chip.32DA32.upload.maximum_size=32256
avrdaopti.menu.chip.32DA32.bootloader.file=optiboot_dx32
avrdaopti.menu.chip.32DA32.upload.maximum_data_size=4096
avrdaopti.menu.chip.32DA32.build.variant=32pin-standard
avrdaopti.menu.chip.32DA48=AVR32DA48
avrdaopti.menu.chip.32DA48.build.mcu=avr32da48
avrdaopti.menu.chip.32DA48.upload.maximum_size=32256
avrdaopti.menu.chip.32DA48.bootloader.file=optiboot_dx32
avrdaopti.menu.chip.32DA48.upload.maximum_data_size=4096
avrdaopti.menu.chip.32DA48.build.variant=48pin-standard

#------------------------------------#
# Clock speed and source options     #
#____________________________________#
avrdaopti.menu.clock.24internal=24 MHz internal
avrdaopti.menu.clock.24internal.build.f_cpu=24000000L
avrdaopti.menu.clock.24internal.build.speed=24
avrdaopti.menu.clock.24internal.build.clocksource=0
avrdaopti.menu.clock.20internal=20 MHz internal
avrdaopti.menu.clock.20internal.build.f_cpu=20000000L
avrdaopti.menu.clock.20internal.build.speed=20
avrdaopti.menu.clock.20internal.build.clocksource=0
avrdaopti.menu.clock.16internal=16 MHz internal
avrdaopti.menu.clock.16internal.build.f_cpu=16000000L
avrdaopti.menu.clock.16internal.build.speed=16
avrdaopti.menu.clock.16internal.build.clocksource=0
avrdaopti.menu.clock.12internal=12 MHz internal
avrdaopti.menu.clock.12internal.build.f_cpu=12000000L
avrdaopti.menu.clock.12internal.build.speed=12
avrdaopti.menu.clock.12internal.build.clocksource=0
avrdaopti.menu.clock.10internal=10 MHz internal
avrdaopti.menu.clock.10internal.build.f_cpu=10000000L
avrdaopti.menu.clock.10internal.build.speed=10
avrdaopti.menu.clock.10internal.build.clocksource=0
avrdaopti.menu.clock.8internal=8 MHz internal
avrdaopti.menu.clock.8internal.build.f_cpu=8000000L
avrdaopti.menu.clock.8internal.build.speed=8
avrdaopti.menu.clock.8internal.build.clocksource=0
avrdaopti.menu.clock.4internal=4 MHz internal
avrdaopti.menu.clock.4internal.build.f_cpu=4000000L
avrdaopti.menu.clock.4internal.build.speed=4
avrdaopti.menu.clock.4internal.build.clocksource=0
avrdaopti.menu.clock.1internal=1 MHz internal
avrdaopti.menu.clock.1internal.build.f_cpu=1000000L
avrdaopti.menu.clock.1internal.build.speed=1
avrdaopti.menu.clock.1internal.build.clocksource=0
avrdaopti.menu.clock.24extclock=24 MHz ext. clock
avrdaopti.menu.clock.24extclock.build.f_cpu=24000000L
avrdaopti.menu.clock.24extclock.build.speed=24
avrdaopti.menu.clock.24extclock.build.clocksource=2
avrdaopti.menu.clock.20extclock=20 MHz ext. clock
avrdaopti.menu.clock.20extclock.build.f_cpu=20000000L
avrdaopti.menu.clock.20extclock.build.speed=20
avrdaopti.menu.clock.20extclock.build.clocksource=2
avrdaopti.menu.clock.16extclock=16 MHz ext. clock
avrdaopti.menu.clock.16extclock.build.f_cpu=16000000L
avrdaopti.menu.clock.16extclock.build.speed=16
avrdaopti.menu.clock.16extclock.build.clocksource=2
avrdaopti.menu.clock.12extclock=12 MHz ext. clock
avrdaopti.menu.clock.12extclock.build.f_cpu=12000000L
avrdaopti.menu.clock.12extclock.build.speed=12
avrdaopti.menu.clock.12extclock.build.clocksource=2
avrdaopti.menu.clock.8extclock=8 MHz ext. clock
avrdaopti.menu.clock.8extclock.build.f_cpu=8000000L
avrdaopti.menu.clock.8extclock.build.speed=8
avrdaopti.menu.clock.8extclock.build.clocksource=2
avrdaopti.menu.clock.28internal=28 MHz internal (overclocked)
avrdaopti.menu.clock.28internal.build.f_cpu=28000000L
avrdaopti.menu.clock.28internal.build.speed=28
avrdaopti.menu.clock.28internal.build.clocksource=0
avrdaopti.menu.clock.32internal=32 MHz internal (overclocked)
avrdaopti.menu.clock.32internal.build.f_cpu=32000000L
avrdaopti.menu.clock.32internal.build.speed=32
avrdaopti.menu.clock.32internal.build.clocksource=0
avrdaopti.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
avrdaopti.menu.clock.25extclock.build.f_cpu=25000000L
avrdaopti.menu.clock.25extclock.build.speed=25
avrdaopti.menu.clock.25extclock.build.clocksource=2
avrdaopti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdaopti.menu.clock.28extclock.build.f_cpu=28000000L
avrdaopti.menu.clock.28extclock.build.speed=28
avrdaopti.menu.clock.28extclock.build.clocksource=2
avrdaopti.menu.clock.30extclock=30 MHz ext. clock (overclocked)
avrdaopti.menu.clock.30extclock.build.f_cpu=30000000L
avrdaopti.menu.clock.30extclock.build.speed=30
avrdaopti.menu.clock.30extclock.build.clocksource=2
avrdaopti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdaopti.menu.clock.32extclock.build.f_cpu=32000000L
avrdaopti.menu.clock.32extclock.build.speed=32
avrdaopti.menu.clock.32extclock.build.clocksource=2
avrdaopti.menu.clock.36extclock=36 MHz ext. clock (overclocked)
avrdaopti.menu.clock.36extclock.build.f_cpu=36000000L
avrdaopti.menu.clock.36extclock.build.speed=36
avrdaopti.menu.clock.36extclock.build.clocksource=2
avrdaopti.menu.clock.40extclock=40 MHz ext. clock (overclocked)
avrdaopti.menu.clock.40extclock.build.f_cpu=40000000L
avrdaopti.menu.clock.40extclock.build.speed=40
avrdaopti.menu.clock.40extclock.build.clocksource=2
avrdaopti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdaopti.menu.clock.48extclock.build.f_cpu=48000000L
avrdaopti.menu.clock.48extclock.build.speed=48
avrdaopti.menu.clock.48extclock.build.clocksource=2


#------------------------------------#
# BrownOut detection (BOD) options   #
#____________________________________#
avrdaopti.menu.bodvoltage.1v9=1.9V
avrdaopti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdaopti.menu.bodvoltage.2v45=2.45V
avrdaopti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdaopti.menu.bodvoltage.2v70=2.70V
avrdaopti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdaopti.menu.bodvoltage.2v85=2.85V
avrdaopti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdaopti.menu.bodmode.disabled=Disabled/Disabled
avrdaopti.menu.bodmode.enabled=Enabled/Enabled
avrdaopti.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrdaopti.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrdaopti.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrdaopti.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrdaopti.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrdaopti.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrdaopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdaopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdaopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdaopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdaopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdaopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdaopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrdaopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdaopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdaopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#------------------------------------#
# Reset pin as input option          #
#____________________________________#
avrdaopti.menu.resetpin.reset=Hardware Reset (recommended)
avrdaopti.menu.resetpin.reset.bootloader.resetpinbits=10
avrdaopti.menu.resetpin.input=Input (no output, ever)
avrdaopti.menu.resetpin.input.bootloader.resetpinbits=00

#------------------------------------#
# millis/micros timing source        #
#____________________________________#
avrdaopti.menu.millis.tcb2=TCB2 (recommended)
avrdaopti.menu.millis.disabled=Disabled (delay() only)
avrdaopti.menu.millis.tcb0=TCB0
avrdaopti.menu.millis.tcb1=TCB1
avrdaopti.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdaopti.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdaopti.menu.millis.tca0=TCA0
avrdaopti.menu.millis.tca1=TCA1 (48/64-pin parts only)
#avrdaopti.menu.millis.tcd0=TCD0
#avrdaopti.menu.millis.rtc=RTC (no micros)
#avrdaopti.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal no micros
#avrdaopti.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avrdaopti.menu.millis.tcb0.build.millistimer=B0
avrdaopti.menu.millis.tcb1.build.millistimer=B1
avrdaopti.menu.millis.tcb2.build.millistimer=B2
avrdaopti.menu.millis.tcb3.build.millistimer=B3
avrdaopti.menu.millis.tcb4.build.millistimer=B4
avrdaopti.menu.millis.tca0.build.millistimer=A0
avrdaopti.menu.millis.tca1.build.millistimer=A1
#avrdaopti.menu.millis.tcd0.build.millistimer=D0
#avrdaopti.menu.millis.rtc.build.millistimer=RTC
#avrdaopti.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
#avrdaopti.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrdaopti.menu.millis.disabled.build.millistimer=NONE

#------------------------------------#
# printf() version options           #
#____________________________________#
avrdaopti.menu.printf.default=Default, 1.5k flash, no floats
avrdaopti.menu.printf.full=Full, 2.6k, prints floats
avrdaopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdaopti.menu.printf.full.build.printfabr=.pfF
avrdaopti.menu.printf.minimal=Minimal, 1.1k flash used
avrdaopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdaopti.menu.printf.minimal.build.printfabr=.pfM

